{
  "levels": [
    {
      "id": 1,
      "character": "yuri",
      "scenes": {
        "stripping": "res://lewds/lewdscene/yuri_strip.tscn",
        "lewd": "res://lewds/lewdscene/yuri_ls.tscn"
      },
      "dialogue": {
        "intro": [
          "Ah, you must be new here?",
          "No sweat, this job is very easy.",
          "All you need is to touch our body and find a spot to strip us.",
          "Ahhh~ My fit is so tight.",
          "Shit, I feel so hot inside... Would you help undress me?"
        ],
        "finish": [
          "I feel so fresh... ahh~",
          "I never thought being naked like this feel fucking amazing.",
          "Boy, I saw your cock is standing... Let me take you to our special room",
          "I am sure you are horny as me now.",
        ]
      }
    },
    {
      "id": 2,
      "character": "mei",
      "scenes": {
        "stripping": "res://lewds/lewdscene/mei_strip.tscn",
        "lewd": "res://lewds/lewdscene/mei_ls.tscn"
      },
      "dialogue": {
        "intro": [
          "Hmm? Who are you?",
          "I never thought there would be a job position of some boy making us strip.",
          "Tch... fucking pervert!",
          "Come here then and make me satisfy..."
        ],
        "finish": [
          "Huh? Why did you make me naked?",
          "This is embarrassing! How dare you...",
          "Hey... Give me back my clothes or I will report you...",
          "Eh... I am feeling weird. Being this naked make me feel aroused.",
          "Hey boy, my nipples are getting wet. Come here and make my tits satisfied!"
        ]
      }
    },
    {
      "id": 3,
      "character": "terra",
      "scenes": {
        "stripping": "res://lewds/lewdscene/terra_strip.tscn",
        "lewd": "res://lewds/lewdscene/terra_ls.tscn"
      },
      "dialogue": {
        "intro": [
          "Hey there, have you seen madam Fleurdelis?",
          "Hmm? She wants me to get stripped by you? How embarrassing!",
          "I'm not stressed here, I don't need such lewd just to stress reliever!",
          "...",
          "...Just for a little bit okay.",
          "I've been dealing with tough headache... Maybe I actually am this stressed.",
        ],
        "finish": [
          "Huh? How did I let you make me fully naked?",
          "Fuck, I think some people saw us here. Hey put my clothes back!",
          "...",
          "...I am getting wet now. Being naked is actually relieving my stress…",
          "Huh? You wanna fuck me? Are you insane?!",
          "Okay fine, I feel a little stress, maybe your dick can cure me... find me a better spot, boy.",
        ]
      }
    }
  ]
}